[
    {
        "label": "non-climate",
        "text": "ACustomer experience ADigitalisation AClear & appropriate adviceAmbitions 2024: AIncrease ABN AMRO's share of new mortgages in the Netherlands to at least 20% AAt least 20% market share among Dutch SMEs APositive NPS for SMEs and mortgage borrowers AGrow market share among affluent clients and entrepreneurs in the Netherlands AMaintain leading position in Dutch corporates ABuild top-3 position in Northwest Europe corporate banking for chosen niche sectors1 AGrow market share among wealthy clients in Northwest EuropeAmbitions 2024: AIncrease volume of client loans and investments to at least one-third of sustainable assets AIncrease client ESG and Impact investments to EUR 46 billion AIncrease financing for circular economy deals to EUR 3.5 billion AIncrease number of A labels in our mortgage portfolio to 28%Ambitions 2024: AReduce ABN AMRO's cost base to no more than EUR 4.7 billion AAt least 90% STP rate of high-volume processes A100% of DevOps teams moved to Cloud AAt least 90% of households' and SMEs' customer service requests handled digitally AStreamline our product portfolio by at least 60%Strategy 2024:In the Netherlands, we will look to increase our market share among SMEs and in mortgages.",
        "gpt-4o-mini_label": "climate",
        "gpt-4o-mini_explanation": "The statement includes goals related to increasing sustainable assets, ESG investments, and financing for circular economy deals, which are all directly related to climate change and environmental sustainability.\n```",
        "comment": "table:this might be part of a table, but it is not explicit however the content is really important to sustainability."
    },
    {
        "label": "non-climate",
        "text": "Handelsbanken's material topics: - Responsible investment- Responsible lendingGRI 103: Management approach <PHONE>-1/2/3Management of material topics4-5, 11-1250-57PRODUCT PORTFOLIO Handelsbanken's material topics: - Responsible investment- Responsible lending- Responsible financing- Sustainable productsGRI 103: Management approach <PHONE>-1/2/3Management of material topics4-5, 10-1150-57FS6Percentage of the portfolio for business lines by specific region, size and by sector1151FS8Monetary value of products and services designed to deliver a specific environ-mental benefit1244, 50, 52ACTIVE OWNERSHIP Handelsbanken's material topics: - Responsible investmentGRI 103: Management approach <PHONE>-1/2/3Management of material topics4-550-57FS10Percentage and number of companies held in the institution's portfolio with which the reporting organisation has interacted on environmental or social issues1254-55FS11Percentage of assets subject to positive and negative environmental or social screening1244LOCAL COMMUNITIES Handelsbanken's material topics: - High availability- Local presence and community engagementGRI 103: Management approach <PHONE>-1/2/3Management of material topics4-5, 810, 48FS13Access points in low-populated or economically disadvantaged areas810, 48FS14Initiatives to improve access to financial services for disadvantaged people1244, 551 SFB Refers to the 2020 Sustainability Fact Book.",
        "gpt-4o-mini_label": "climate",
        "gpt-4o-mini_explanation": "The statement includes references to responsible investment, responsible lending, and products designed to deliver environmental benefits, which are all related to climate change and environmental sustainability.\n```",
        "comment": "table:might be part of a table of footnote"
    },
    {
        "label": "non-climate",
        "text": "Anti-competitive behavior GRI 103 Management approach 103-1 Explanation of the material topic and its boundary Strategy and business model/Materiality Global Corporate governance and strong management of all risks Business ethics, culture and customer protection 103-2 The management approach and its components Ethical behavior/Compliance system Global Corporate governance and strong management of all risks Business ethics, culture and customer protection 103-3 Evaluation of the management approach Ethical behavior/Compliance system Global Corporate governance and strong management of all risks Business ethics, culture and customer protection GRI 206 Anti-competitive behavior 206-1 Legal actions for anti-competitive behavior, anti-trust, and monopoly practices BBVA has not identified any significant lawsuit in which a final ruling against this concept has been issued Global Corporate governance and strong management of all risks Business ethics, culture and customer protection Tax GRI 103 Management approach 103-1 Explanation of the material topic and its boundary Strategy and business model/Materiality Global Solvency and financial results 103-2 The management approach and its components Contribucion a la sociedad/Transparencia fiscal Global Solvency and financial results 103-3 Evaluation of the management approach Contribucion a la sociedad/Transparencia fiscal Global Solvency and financial results GRI 207 Tax 207-1 Approach to tax Contribution to society/Fiscal transparency Global Solvency and financial results 207-2 Tax governance, control, and risk management Contribution to society/Fiscal transparency Global Solvency and financial results 207-3 Stakeholder engagement and management of concerns related to tax Contribution to society/Fiscal transparency Global Solvency and financial results 207-4 Country-by-country reporting Contribution to society/Fiscal transparency Consolidated Financial Statements ( Appendix XIII) Global Solvency and financial results ENVIRONMENTAL CATEGORY GRI 103 Management approach 103-1 Explanation of the material topic and its boundary Strategy and business model/Materiality Global Climate change: opportunities and risks 103-2 The management approach and its components Sustainability at BBVA /Environmental impact and risk management/Management of direct environmental impacts Global Climate change: opportunities and risks 125 103-3 Evaluation of the management approach Sustainability at BBVA /Environmental impact and risk management/Management of direct environmental impacts Global Climate change: opportunities and risks Materials GRI 301 Materials 301-1 Materials used by weight or volume Sustainability at BBVA /Environmental impact and risk management/Management of direct environmental impacts Global Environment and climate change (external) 301-2 Recycled input materials used All paper consumed in Spain is environmental respectfull and 100% certified Spain Environment and climate change (external) 301-3 Reclaimed products and their packaging materials Given the activities of BBVA Group, this indicator is not considered material.",
        "gpt-4o-mini_label": "climate",
        "gpt-4o-mini_explanation": "The text includes references to \"Climate change: opportunities and risks\" and discusses \"Environmental impact and risk management,\" which are directly related to climate change and environmental sustainability issues.\n```",
        "comment": "table:seems to be a table of content"
    },
    {
        "label": "non-climate",
        "text": "In addition to its role of providing the Board of Directors with general professional advice on sustainability issues applicable to the assets under management, the Sustainability Committee is responsible for periodically monitoring the investment choices of the ethical funds and the management strategy adopted by these funds during the reference period.",
        "gpt-4o-mini_label": "climate",
        "gpt-4o-mini_explanation": "The statement discusses the role of the Sustainability Committee in monitoring investment choices related to ethical funds, which pertains to sustainability issues and environmental considerations.\n```",
        "comment": "debatable,general:describe the role of a comittee would argue that this is related"
    },
    {
        "label": "non-climate",
        "text": "This year's Sustainability Report is Handelsbanken's eleventh in accord-ance with the GRI and relates to the 2020 calen-",
        "gpt-4o-mini_label": "climate",
        "gpt-4o-mini_explanation": "The statement mentions a Sustainability Report, which typically includes information related to climate change and environmental sustainability practices.\n```",
        "comment": "debatable,general:might be a prompt from GRI, not fully relevant but still a bit"
    },
    {
        "label": "non-climate",
        "text": "(Source: D-Rating 2020)Efficient11 banks of which 1 NordicRich & efficient Nordea and 17 other banksLaggard11 banks of which 1 NordicRich11 banksAverage7 banksDigital customer experience recently recognised for richness of features and efficiency of digital journey and contact channelsANNUAL REPORT 2020 13 NORDEANORDEA AS AN INVESTMENTWe are a leader in sustainable bankingWe have had lower-than-average loan losses over the business cycleWe are fully committed to making the financial sector more sustainableGenerating low credit losses over the business cycle means sustainable and low-risk growth Track record of strong credit quality with diversified portfolio, de-risked over past ten years1955European banks average (2008-2020)312623211514151278050100202020192018201720162015201420132012201120102009200826Loan loss ratio including similar net result (bp)~9.2 millionHousehold customers~540,000Small & medium-sized companies~2 , 3 50 Large corporates & institutionsEUR 1.2bn (+110%)FY 2020Growth in green corporate loansEUR 207m(+14 3 %)FY 2020Growth in green mortgagesEUR 15.5bn (+2 5 6%)FY 2020Increase in transaction volumes for sustainability-linked loansEUR 36.3 bn (+2 6 5%)FY 2020AuM in sustainability-enhanced fundsWe are a trusted long-term financial partner with scaleWe are a Nordic universal bank with a strong market positionCredit portfolio per country as at December 2020Assets under management distribution (EUR 354bn as at December 2020) Denmark Norway Inst. sales Private bankingXXXXXXXX25%21%22%31%34%16%28%21%1) Company data, Deutsche Bank Research.",
        "gpt-4o-mini_label": "climate",
        "gpt-4o-mini_explanation": "The statement discusses the bank's commitment to sustainable banking, growth in green corporate loans, and sustainability-linked loans, which are all directly related to climate change and environmental sustainability.\n```",
        "comment": "table:seems to be a table"
    },
    {
        "label": "non-climate",
        "text": "The range of sustainable investments and the availability of insurance solutions for the protection of customers are other key examples of the Group's responsible approach.",
        "gpt-4o-mini_label": "climate",
        "gpt-4o-mini_explanation": "The statement refers to sustainable investments and insurance solutions that protect customers, which are related to environmental sustainability and responsible financial practices in the context of climate change.\n```",
        "comment": "debatable,general:sustainability has a part of env."
    },
    {
        "label": "non-climate",
        "text": "Firstly, Nordic customers are relatively advanced in their sustainability considerations, and they expect their bank to be able to support sustainable development across segments.",
        "gpt-4o-mini_label": "climate",
        "gpt-4o-mini_explanation": "The statement addresses sustainability considerations and the expectation for banks to support sustainable development, which are directly related to climate change and environmental sustainability issues.\n```",
        "comment": "debatable,general:sustainability"
    },
    {
        "label": "non-climate",
        "text": "Climate change) (new)2SEKm1.40.4Sports and cultureSEKm10.319.421.913.2Other community investments2SEKm2.36.53.04.4Number of people coached in entrepreneurship (new)3Number31,274Number of people trained in Inclusion & Diversity, and/or Equality (new)3Number5,114Number of people engaged in an environmental activity (new)3Number7,132By countrySwedenSEKm33.337.237.638.4EstoniaSEKm3.23.13.14.0LatviaSEKm1.72.03.13.0LithuaniaSEKm3.22.72.62.2DenmarkSEKm0.02.00.00.0Norway SEKm0.40.93.32.0FinlandSEKm0.70.80.70.5Other sitesSEKm0.43.32.92.6By type of engagementEmployee volunteering hours 4Hours22,28917,82617,09118,7801) Previous years' figures have been revised (membership fees have been excluded).",
        "gpt-4o-mini_label": "climate",
        "gpt-4o-mini_explanation": "The statement includes a reference to the number of people engaged in an environmental activity, which is directly related to climate change and environmental sustainability.\n```",
        "comment": "table:table"
    },
    {
        "label":"non-climate",
        "text":"ING matched all donations made by customers and colleagues, contributing more than EUR2 million to UNICEF's global appeal. In July, we launched the third phase, which involves funding for projects to help communities recover sustainably in the longer term.",
        "gpt-4o-mini_label":"climate",
        "gpt-4o-mini_explanation":"The statement mentions funding for projects aimed at helping communities recover sustainably, which relates to environmental sustainability and climate change efforts.\nLabel: climate\n```",
        "comment":"debatable,general:sustainable/UNICEF"
    }
]